{"config": [{"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "use_bias": true, "filters": 32, "kernel_constraint": null, "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "trainable": true, "name": "conv2d_1", "dtype": "float32", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "use_bias": true, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "trainable": true, "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "dense_1", "units": 128, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"seed": null, "noise_shape": null, "rate": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "dense_2", "units": 10, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Sequential"}