{"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"layer": {"config": {"unit_forget_bias": true, "recurrent_dropout": 0.0, "use_bias": true, "unroll": false, "dropout": 0.0, "implementation": 1, "kernel_regularizer": null, "stateful": false, "units": 128, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "bias_regularizer": null, "return_sequences": false, "activation": "tanh", "kernel_constraint": null, "go_backwards": false, "trainable": true, "name": "lstm_1", "recurrent_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, "trainable": true, "name": "time_distributed_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "time_distributed_1", "class_name": "TimeDistributed"}, {"config": {"unit_forget_bias": true, "recurrent_dropout": 0.0, "use_bias": true, "unroll": false, "dropout": 0.0, "implementation": 1, "kernel_regularizer": null, "stateful": false, "units": 128, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "bias_regularizer": null, "return_sequences": false, "activation": "tanh", "kernel_constraint": null, "go_backwards": false, "trainable": true, "name": "lstm_2", "recurrent_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "name": "lstm_2", "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "dense_3", "units": 10, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Model"}