{"config": [{"config": {"dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "dense_4", "units": 512, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"seed": null, "noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "dense_5", "units": 512, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"seed": null, "noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "dense_6", "units": 10, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Sequential"}